rule('R1') {
    _if_ = [{ (O == CLOSEDWAREHOUSE) || (O == WORKSHOP) }, {W>=0.1}, {W<1}, {h>=1}, {h<=10}]
    _then_ = { RESULT = [NKPK] }
    _reason_ = 'Выбран объект обслуживания Цех или Закрытый склад, \nгрузоподъемность от 0.1 до 1 КГ \nи высота подъема от 1 до 10'
}
rule('R2') {
    _if_ = [{ (O == CLOSEDWAREHOUSE) || (O == WORKSHOP) }, {W>=10}, {W<=600}, {h>=3}, {h<=50}]
    _then_ = { RESULT = [MK] }
    _reason_ = 'Выбран объект обслуживания Цех или Закрытый склад, \nгрузоподъемность от 10 до 600 КГ \nи высота подъема от 3 до 50'
}
rule('R3') {
    _if_ = [{ (O == CLOSEDWAREHOUSE) || (O == WORKSHOP) }, {W>=1}, {W<=10}, {h>=1}, {h<3}]
    _then_ = { RESULT = [NKPK] }
    _reason_ = 'Выбран объект обслуживания Цех или Закрытый склад, \nгрузоподъемность от 10 до 600 КГ \nи высота подъема от 3 до 50'
}
rule('R4') {
    _if_ = [{ (O == CLOSEDWAREHOUSE) || (O == WORKSHOP) }, {W>=1}, {W<=10}, {h>=3}, {h<=10}]
    _then_ = { RESULT = [NKPK, MK] }
    _reason_ = 'Выбран объект обслуживания Цех или Закрытый склад, \nгрузоподъемность от 11 до 10 КГ \nи высота подъема от 3 до 10'
}
rule('R5') {
    _if_ = [{ (O == CLOSEDWAREHOUSE) || (O == WORKSHOP) }, {W>=1}, {W<3}, {h>10}, {h<=50}]
    _then_ = { RESULT = [MK] }
    _reason_ = 'Выбран объект обслуживания Цех или Закрытый склад, \nгрузоподъемность от 1 до 3 КГ \nи высота подъема от 10 до 50'
}
rule('R6') {
    _if_ = [{ (O == POWERSTATION) || (O == WAREHOUSE) }, {W>=1}, {W<3}, {h>=3}, {h<=50}]
    _then_ = { RESULT = [MK] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 1 до 3 КГ \nи высота подъема от 3 до 50'
}
rule('R7') {
    _if_ = [{ (O == POWERSTATION) || (O == WAREHOUSE) }, {W>=3}, {W<5}, {h>=2}, {h<3}]
    _then_ = { RESULT = [KK] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 3 до 5 КГ \nи высота подъема от 2 до 3'
}
rule('R8') {
    _if_ = [{ (O == POWERSTATION) || (O == WAREHOUSE) }, {W>=3}, {W<5}, {h>=3}, {h<=20}]
    _then_ = { RESULT = [MK, KK] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 3 до 5 КГ \nи высота подъема от 3 до 20'
}
rule('R9') {
    _if_ = [{ (O == POWERSTATION) || (O == WAREHOUSE) }, {W>=3}, {W<5}, {h>20}, {h<=50}]
    _then_ = { RESULT = [MK] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 3 до 5 КГ \nи высота подъема от 20 до 50'
}
rule('R10') {
    _if_ = [{ (O == POWERSTATION) || (O == WAREHOUSE) }, {W>=5}, {W<=300}, {h>=1}, {h<2}]
    _then_ = { RESULT = [MP] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 5 до 300 КГ \nи высота подъема от 1 до 2'
}
rule('R11') {
    _if_ = [{ (O == POWERSTATION) || (O == WAREHOUSE) }, {W>=5}, {W<=300}, {h>=2}, {h<3}]
    _then_ = { RESULT = [KK, MP] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 5 до 300 КГ \nи высота подъема от 2 до 3'
}
rule('R12') {
    _if_ = [{ (O == POWERSTATION) || (O == WAREHOUSE) }, {W>=5}, {W<=300}, {h>=3}, {h<15}]
    _then_ = { RESULT = [MK, KK, MP] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 5 до 300 КГ \nи высота подъема от 3 до 15'
}
rule('R13') {
    _if_ = [{ (O == POWERSTATION) || (O == WAREHOUSE) }, {W>=5}, {W<=300}, {h>=15}, {h<=20}]
    _then_ = { RESULT = [MK, KK] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 5 до 300 КГ \nи высота подъема от 15 до 20'
}
rule('R14') {
    _if_ = [{ (O == POWERSTATION) || (O == WAREHOUSE) }, {W>=5}, {W<=300}, {h>20}, {h<=50}]
    _then_ = { RESULT = [MK] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 5 до 300 КГ \nи высота подъема от 20 до 50'
}
rule('R15') {
    _if_ = [{ (O == POWERSTATION) || (O == WAREHOUSE) }, {W>300}, {W<=600}, {h>=2}, {h<=3}]
    _then_ = { RESULT = [KK] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 300 до 600 КГ \nи высота подъема от 2 до 3'
}
rule('R16') {
    _if_ = [{ (O == POWERSTATION) || (O == WAREHOUSE) }, {W>300}, {W<=600}, {h>=3}, {h<20}]
    _then_ = { RESULT = [MK, KK] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 300 до 600 КГ \nи высота подъема от 3 до 20'
}
rule('R17') {
    _if_ = [{ (O == POWERSTATION) || (O == WAREHOUSE) }, {W>300}, {W<=600}, {h>20}, {h<=50}]
    _then_ = { RESULT = [MK] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 300 до 600 КГ \nи высота подъема от 20 до 50'
}
rule('R18') {
    _if_ = [{ (O == POWERSTATION) || (O == WAREHOUSE) }, {W>600}, {W<=1000}, {h>=2}, {h<=20}]
    _then_ = { RESULT = [KK] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 600 до 1000 КГ \nи высота подъема от 2 до 20'
}
rule('R19') {
    _if_ = [{ (O == CONSTRUCTION) || (O == WAREHOUSE) }, {W>=3}, {W<5}, {h>=2}, {h<=20}]
    _then_ = { RESULT = [KK] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 3 до 5 КГ \nи высота подъема от 2 до 20'
}
rule('R20') {
    _if_ = [{ (O == CONSTRUCTION) || (O == WAREHOUSE) }, {W>=5}, {W<8}, {h>=2}, {h<=20}]
    _then_ = { RESULT = [KK, PK] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 5 до 8 КГ \nи высота подъема от 2 до 20'
}
rule('R20_1') {
    _if_ = [{ (O == CONSTRUCTION) || (O == WAREHOUSE) }, {W>50}, {W<=300}, {h>=2}, {h<=20}]
    _then_ = { RESULT = [KK, PK] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 50 до 300 КГ \nи высота подъема от 2 до 20'
}
rule('R21') {
    _if_ = [{ (O == CONSTRUCTION) || (O == WAREHOUSE) }, {W>50}, {W<=300}, {h>20}, {h<=50}]
    _then_ = { RESULT = [PK] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 50 до 300 КГ \nи высота подъема от 20 до 50'
}
rule('R21_1') {
    _if_ = [{ (O == CONSTRUCTION) || (O == WAREHOUSE) }, {W>=5}, {W<8}, {h>20}, {h<=50}]
    _then_ = { RESULT = [PK] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 5 до 8 КГ \nи высота подъема от 20 до 50'
}
rule('R22') {
    _if_ = [{ (O == CONSTRUCTION) || (O == WAREHOUSE) }, {W>=8}, {W<10}, {h>=1}, {h<2}]
    _then_ = { RESULT = [SSK] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 8 до 10 КГ \nи высота подъема от 1 до 2'
}
rule('R23') {
    _if_ = [{ (O == CONSTRUCTION) || (O == WAREHOUSE) }, {W>=8}, {W<10}, {h>=2}, {h<=20}]
    _then_ = { RESULT = [KK, SSK, PK] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 8 до 10 КГ \nи высота подъема от 2 до 20'
}
rule('R24') {
    _if_ = [{ (O == CONSTRUCTION) || (O == WAREHOUSE) }, {W>=8}, {W<10}, {h>20}, {h<=50}]
    _then_ = { RESULT = [SSK, PK] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 8 до 10 КГ \nи высота подъема от 20 до 50'
}
rule('R25') {
    _if_ = [{ (O == CONSTRUCTION) || (O == WAREHOUSE) }, {W>=8}, {W<10}, {h>50}, {h<=60}]
    _then_ = { RESULT = [SSK] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 8 до 10 КГ \nи высота подъема от 20 до 50'
}
rule('R26') {
    _if_ = [{ (O == CONSTRUCTION) || (O == WAREHOUSE) }, {W>=10}, {W<30}, {h>=1}, {h<2}]
    _then_ = { RESULT = [SSK] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 10 до 30 КГ \nи высота подъема от 1 до 2'
}
rule('R27') {
    _if_ = [{ (O == CONSTRUCTION) || (O == WAREHOUSE) }, {W>=10}, {W<30}, {h>=2}, {h<3}]
    _then_ = { RESULT = [KK, SSK, PK] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 10 до 30 КГ \nи высота подъема от 2 до 3'
}
rule('R28') {
    _if_ = [{ (O == CONSTRUCTION) || (O == WAREHOUSE) }, {W>=10}, {W<30}, {h>=3}, {h<=20}]
    _then_ = { RESULT = [KK, SSK, BK, PK] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 10 до 30 КГ \nи высота подъема от 3 до 20'
}
rule('R29') {
    _if_ = [{ (O == CONSTRUCTION) || (O == WAREHOUSE) }, {W>=10}, {W<30}, {h>20}, {h<=50}]
    _then_ = { RESULT = [SSK, BK, PK] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 10 до 30 КГ \nи высота подъема от 20 до 50'
}
rule('R30') {
    _if_ = [{ (O == CONSTRUCTION) || (O == WAREHOUSE) }, {W>=10}, {W<30}, {h>50}, {h<=60}]
    _then_ = { RESULT = [SSK, BK] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 10 до 30 КГ \nи высота подъема от 50 до 60'
}
rule('R31') {
    _if_ = [{ (O == CONSTRUCTION) || (O == WAREHOUSE) }, {W>=10}, {W<30}, {h>60}, {h<=150}]
    _then_ = { RESULT = [BK] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 10 до 30 КГ \nи высота подъема от 60 до 150'
}
rule('R32') {
    _if_ = [{ (O == CONSTRUCTION) || (O == WAREHOUSE) }, {W>=30}, {W<50}, {h>=2}, {h<3}]
    _then_ = { RESULT = [KK, PK] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 30 до 50 КГ \nи высота подъема от 2 до 3'
}
rule('R33') {
    _if_ = [{ (O == CONSTRUCTION) || (O == WAREHOUSE) }, {W>=30}, {W<50}, {h>=3}, {h<=20}]
    _then_ = { RESULT = [KK, BK, PK] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 30 до 50 КГ \nи высота подъема от 3 до 20'
}
rule('R34') {
    _if_ = [{ (O == CONSTRUCTION) || (O == WAREHOUSE) }, {W>=30}, {W<50}, {h>20}, {h<=50}]
    _then_ = { RESULT = [BK, PK] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 30 до 50 КГ \nи высота подъема от 20 до 50'
}
rule('R35') {
    _if_ = [{ (O == CONSTRUCTION) || (O == WAREHOUSE) }, {W>=30}, {W<50}, {h>50}, {h<=150}]
    _then_ = { RESULT = [BK] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 30 до 50 КГ \nи высота подъема от 50 до 150'
}
rule('R36') {
    _if_ = [{ (O == CONSTRUCTION) || (O == WAREHOUSE) }, {W>300}, {W<1000}, {h>=2}, {h<=20}]
    _then_ = { RESULT = [KK] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 300 до 1000 КГ \nи высота подъема от 2 до 20'
}
rule('R37') {
    _if_ = [{ O == RIVERPORT }, {W>5}, {W<10}, {h>=1}, {h<2}]
    _then_ = { RESULT = [MP] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 5 до 10 КГ \nи высота подъема от 1 до 2'
}
rule('R38') {
    _if_ = [{ O == RIVERPORT }, {W>5}, {W<10}, {h>=2}, {h<=15}]
    _then_ = { RESULT = [MP, PP] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 5 до 10 КГ \nи высота подъема от 2 до 15'
}
rule('R39') {
    _if_ = [{ O == RIVERPORT }, {W>5}, {W<10}, {h>15}, {h<=50}]
    _then_ = { RESULT = [PP] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 5 до 10 КГ \nи высота подъема от 15 до 50'
}
rule('R40') {
    _if_ = [{ O == RIVERPORT }, {W>=10}, {W<=50}, {h>=1}, {h<2}]
    _then_ = { RESULT = [MP] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 10 до 50 КГ \nи высота подъема от 1 до 2'
}
rule('R41') {
    _if_ = [{ O == RIVERPORT }, {W>=10}, {W<=50}, {h>=2}, {h<3}]
    _then_ = { RESULT = [MP, PP] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 10 до 50 КГ \nи высота подъема от 2 до 3'
}
rule('R42') {
    _if_ = [{ O == RIVERPORT }, {W>=10}, {W<=50}, {h>=3}, {h<=15}]
    _then_ = { RESULT = [MP, BK, PP] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 10 до 50 КГ \nи высота подъема от 3 до 15'
}
rule('R43') {
    _if_ = [{ O == RIVERPORT }, {W>=10}, {W<=50}, {h>15}, {h<=50}]
    _then_ = { RESULT = [BK, PP] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 10 до 50 КГ \nи высота подъема от 15 до 50'
}
rule('R44') {
    _if_ = [{ O == RIVERPORT }, {W>=10}, {W<=50}, {h>50}, {h<=150}]
    _then_ = { RESULT = [BK] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 10 до 50 КГ \nи высота подъема от 50 до 150'
}
rule('R45') {
    _if_ = [{ O == RIVERPORT }, {W>=50}, {W<=300}, {h>=1}, {h<2}]
    _then_ = { RESULT = [MP] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 50 до 300 КГ \nи высота подъема от 1 до 2'
}
rule('R46') {
    _if_ = [{ O == RIVERPORT }, {W>=50}, {W<=300}, {h>=2}, {h<=15}]
    _then_ = { RESULT = [MP, PP] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 50 до 300 КГ \nи высота подъема от 2 до 15'
}
rule('R47') {
    _if_ = [{ O == RIVERPORT }, {W>=50}, {W<=300}, {h>15}, {h<=50}]
    _then_ = { RESULT = [PP] }
    _reason_ = 'Выбран объект обслуживания Электростанция или Открытый склад, \nгрузоподъемность от 50 до 300 КГ \nи высота подъема от 15 до 50'
}