rule('R1') {
    _if_ = [{ O == WORKSHOP }, {V > 10000}]
    _then_ = { RESULT = [NKPK] }
    _reason_ = 'Выбрано объект обслуживания Цех и скорость подъема - от 60 до 200'
}
rule('R2') {
    _if_ = [{ O == WORKSHOP }, {V >= 1}, {V <= 60}, {H >= 1}, {H < 3}]
    _then_ = { RESULT = [NKPK] }
    _reason_ = 'Выбран объект обслуживания Цех, скорость подъема - от 1 до 60 и высота подъема от 1 до 3'
}
rule('R3') {
    _if_ = [{ O == WORKSHOP }, {V >= 1}, {V <= 60}, {H > 10}, {H <= 50}]
    _then_ = { RESULT = [MK] }
    _reason_ = 'Выбран объект обслуживания Цех, скорость подъема - от 1 до 60 и высота подъема от 10 до 50'
}
rule('R4') {
    _if_ = [{ O == WORKSHOP }, {V >= 1}, {V <= 60}, {H >= 3}, {H <= 10}, {W >= 0.1}, {W < 1}]
    _then_ = { RESULT = [NKPK] }
    _reason_ = 'Выбран объект обслуживания Цех,\nскорость подъема - от 1 до 60,\nвысота подъема от 3 до 10\nи грузоподъемность от 0.1 до 1'
}
rule('R5') {
    _if_ = [{ O == WORKSHOP }, {V >= 1}, {V <= 60}, {H >= 3}, {H <= 10}, {W >= 1}, {W < 10}]
    _then_ = { RESULT = [NKPK, MK] }
    _reason_ = 'Выбран объект обслуживания Цех,\nскорость подъема - от 1 до 60,\nвысота подъема от 3 до 10\nи грузоподъемность от 1 до 10'
}
rule('R6') {
    _if_ = [{ O == WORKSHOP }, {V >= 1}, {V <= 60}, {H >= 3}, {H <= 10}, {W > 10}, {W <= 600}]
    _then_ = { RESULT = [MK] }
    _reason_ = 'Выбран объект обслуживания Цех,\nскорость подъема - от 1 до 60,\nвысота подъема от 3 до 10\nи грузоподъемность от 10 до 600'
}
rule('R7') {
    _if_ = [{ O == WAREHOUSE }, {V > 60}, {V <= 200}]
    _then_ = { RESULT = [NKPK] }
    _reason_ = 'Выбран объект обслуживания Закрытый склад,\nскорость подъема - от 60 до 200'
}
rule('R8') {
    _if_ = [{ O == WAREHOUSE }, {V >= 1}, {V <= 60}, {H >= 1}, {H < 3}]
    _then_ = { RESULT = [NKPK] }
    _reason_ = 'Выбран объект обслуживания Закрытый склад,\nскорость подъема - от 1 до 60,\nи высота подъема от 1 до 3'
}
rule('R9') {
    _if_ = [{ O == WAREHOUSE }, {V >= 1}, {V <= 60}, {H >= 3}, {H <= 10}]
    _then_ = { RESULT = [NKPK, MK] }
    _reason_ = 'Выбран объект обслуживания Закрытый склад,\nскорость подъема - от 1 до 60,\nи высота подъема от 3 до 10'
}
rule('R10') {
    _if_ = [{ O == WAREHOUSE }, {V >= 1}, {V <= 60}, {H > 10}, {H <= 50}]
    _then_ = { RESULT = [MK] }
    _reason_ = 'Выбран объект обслуживания Закрытый склад,\nскорость подъема - от 1 до 60,\nи высота подъема от 10 до 50'
}
rule('R11') {
    _if_ = [{ O == RIVERPORT }, {V > 100}, {V <= 180}]
    _then_ = { RESULT = [MP] }
    _reason_ = 'Выбран объект обслуживания Речной порт,\nскорость подъема - от 100 до 180'
}
rule('R12') {
    _if_ = [{ O == RIVERPORT }, {V > 90}, {V <= 100}, {H >= 1}, {H < 3}]
    _then_ = { RESULT = [MP] }
    _reason_ = 'Выбран объект обслуживания Речной порт,\nскорость подъема - от 90 до 100\nи высота подъема от 1 до 3'
}
rule('R13') {
    _if_ = [{ O == RIVERPORT }, {V > 90}, {V <= 100}, {H > 15}, {H <= 150}]
    _then_ = { RESULT = [BK] }
    _reason_ = 'Выбран объект обслуживания Речной порт,\nскорость подъема - от 90 до 100\nи высота подъема от 15 до 150'
}
rule('R14') {
    _if_ = [{ O == RIVERPORT }, {V > 90}, {V <= 100}, {H >= 3}, {H <= 15}, {G >= 5}, {G < 10}]
    _then_ = { RESULT = [MP] }
    _reason_ = 'Выбран объект обслуживания Речной порт,\nскорость подъема - от 90 до 100,\n высота подъема от 3 до 15\nи грузоподъемность от 5 до 10'
}
rule('R15') {
    _if_ = [{ O == RIVERPORT }, {V > 90}, {V <= 100}, {H >= 3}, {H <= 15}, {G >= 10}, {G <= 50}]
    _then_ = { RESULT = [MP, BK] }
    _reason_ = 'Выбран объект обслуживания Речной порт,\nскорость подъема - от 90 до 100,\n высота подъема от 3 до 15\nи грузоподъемность от 10 до 50'
}
rule('R16') {
    _if_ = [{ O == RIVERPORT }, {V > 90}, {V <= 100}, {H >= 3}, {H <= 15}, {G > 50}, {G <= 300}]
    _then_ = { RESULT = [BK] }
    _reason_ = 'Выбран объект обслуживания Речной порт,\nскорость подъема - от 90 до 100,\n высота подъема от 3 до 15\nи грузоподъемность от 50 до 300'
}
rule('R17') {
    _if_ = [{ O == RIVERPORT }, {V >= 1}, {V <= 90}, {H >= 1}, {H < 2}]
    _then_ = { RESULT = [MP] }
    _reason_ = 'Выбран объект обслуживания Речной порт,\nскорость подъема - от 1 до 90\nи высота подъема от 1 до 2'
}
rule('R18') {
    _if_ = [{ O == RIVERPORT }, {V >= 1}, {V <= 90}, {H >= 2}, {H < 3}]
    _then_ = { RESULT = [MP, PK] }
    _reason_ = 'Выбран объект обслуживания Речной порт,\nскорость подъема - от 1 до 90\nи высота подъема от 2 до 3'
}
rule('R19') {
    _if_ = [{ O == RIVERPORT }, {V >= 1}, {V <= 90}, {H >= 3}, {H <= 15}, {W >= 5}, {W < 10}]
    _then_ = { RESULT = [MP, PK] }
    _reason_ = 'Выбран объект обслуживания Речной порт,\nскорость подъема - от 1 до 90,\n высота подъема от 3 до 15\nи грузоподъемность от 5 до 10'
}
rule('R20') {
    _if_ = [{ O == RIVERPORT }, {V >= 1}, {V <= 90}, {H >= 3}, {H <= 15}, {W >= 10}, {W <= 50}]
    _then_ = { RESULT = [MP, PK, BK] }
    _reason_ = 'Выбран объект обслуживания Речной порт,\nскорость подъема - от 1 до 90,\n высота подъема от 3 до 15\nи грузоподъемность от 10 до 50'
}
rule('R21') {
    _if_ = [{ O == RIVERPORT }, {V >= 1}, {V <= 90}, {H >= 3}, {H <= 15}, {W > 50}, {W <= 300}]
    _then_ = { RESULT = [MP, PK] }
    _reason_ = 'Выбран объект обслуживания Речной порт,\nскорость подъема - от 1 до 90,\n высота подъема от 3 до 15\nи грузоподъемность от 50 до 300'
}
rule('R22') {
    _if_ = [{ O == RIVERPORT }, {V >= 1}, {V <= 90}, {H > 15}, {H <= 50}, {W >= 5}, {W < 10}]
    _then_ = { RESULT = [PK] }
    _reason_ = 'Выбран объект обслуживания Речной порт,\nскорость подъема - от 1 до 90,\n высота подъема от 15 до 50\nи грузоподъемность от 5 до 10'
}
rule('R23') {
    _if_ = [{ O == RIVERPORT }, {V >= 1}, {V <= 90}, {H > 15}, {H <= 50}, {W >= 10}, {W <= 50}]
    _then_ = { RESULT = [PK, BK] }
    _reason_ = 'Выбран объект обслуживания Речной порт,\nскорость подъема - от 1 до 90,\n высота подъема от 15 до 50\nи грузоподъемность от 10 до 50'
}
rule('R24') {
    _if_ = [{ O == RIVERPORT }, {V >= 1}, {V <= 90}, {H > 15}, {H <= 50}, {W > 50}, {W <= 300}]
    _then_ = { RESULT = [PK] }
    _reason_ = 'Выбран объект обслуживания Речной порт,\nскорость подъема - от 1 до 90,\n высота подъема от 15 до 50\nи грузоподъемность от 50 до 300'
}
rule('R25') {
    _if_ = [{ O == RIVERPORT }, {V >= 1}, {V <= 90}, {H > 50}, {H <= 150}]
    _then_ = { RESULT = [BK] }
    _reason_ = 'Выбран объект обслуживания Речной порт,\nскорость подъема - от 1 до 90\nи высота подъема от 50 до 150'
}
rule('R26') {
    _if_ = [{ O == POWERSTATION }, {V >= 1}, {V <= 60}, {H >= 1}, {H < 2}]
    _then_ = { RESULT = [MP] }
    _reason_ = 'Выбран объект обслуживания Электростанция,\nскорость подъема - от 1 до 60\nи высота подъема от 1 до 2'
}
rule('R27') {
    _if_ = [{ O == POWERSTATION }, {V >= 1}, {V <= 60}, {H >= 2}, {H < 3}, {W >=3}, {W < 5}]
    _then_ = { RESULT = [KK] }
    _reason_ = 'Выбран объект обслуживания Электростанция,\nскорость подъема - от 1 до 60\nи высота подъема от 2 до 3,\nи грузоподъемность от 3 до 5'
}
rule('R28') {
    _if_ = [{ O == POWERSTATION }, {V >= 1}, {V <= 60}, {H >= 2}, {H < 3}, {W >=5}, {W <= 300}]
    _then_ = { RESULT = [KK, MP] }
    _reason_ = 'Выбран объект обслуживания Электростанция,\nскорость подъема - от 1 до 60\nи высота подъема от 2 до 3,\nи грузоподъемность от 5 до 300'
}
rule('R29') {
    _if_ = [{ O == POWERSTATION }, {V >= 1}, {V <= 60}, {H >= 2}, {H < 3}, {W >300}, {W <= 1000}]
    _then_ = { RESULT = [KK] }
    _reason_ = 'Выбран объект обслуживания Электростанция,\nскорость подъема - от 1 до 60\nи высота подъема от 2 до 3,\nи грузоподъемность от 300 до 1000'
}
rule('R30') {
    _if_ = [{ O == POWERSTATION }, {V >= 1}, {V <= 60}, {H >= 3}, {H <= 15}, {W >= 3}, {W < 5}]
    _then_ = { RESULT = [MK] }
    _reason_ = 'Выбран объект обслуживания Электростанция,\nскорость подъема - от 1 до 60\nи высота подъема от 3 до 15,\nи грузоподъемность от 3 до 5'
}
rule('R31') {
    _if_ = [{ O == POWERSTATION }, {V >= 1}, {V <= 60}, {H >= 3}, {H <= 15}, {W >= 5}, {W <= 300}]
    _then_ = { RESULT = [MK, KK, MP] }
    _reason_ = 'Выбран объект обслуживания Электростанция,\nскорость подъема - от 1 до 60\nи высота подъема от 3 до 15,\nи грузоподъемность от 5 до 300'
}
rule('R32') {
    _if_ = [{ O == POWERSTATION }, {V >= 1}, {V <= 60}, {H >= 3}, {H <= 15}, {W > 300}, {W <= 600}]
    _then_ = { RESULT = [MK, KK] }
    _reason_ = 'Выбран объект обслуживания Электростанция,\nскорость подъема - от 1 до 60\nи высота подъема от 3 до 15,\nи грузоподъемность от 300 до 600'
}
rule('R33') {
    _if_ = [{ O == POWERSTATION }, {V >= 1}, {V <= 60}, {H >= 3}, {H <= 15}, {W > 600}, {W <= 1000}]
    _then_ = { RESULT = [KK] }
    _reason_ = 'Выбран объект обслуживания Электростанция,\nскорость подъема - от 1 до 60\nи высота подъема от 3 до 15,\nи грузоподъемность от 600 до 1000'
}
rule('R34') {
    _if_ = [{ O == POWERSTATION }, {V >= 1}, {V <= 60}, {H > 15}, {H <= 20}, {W >= 1}, {W < 3}]
    _then_ = { RESULT = [MK] }
    _reason_ = 'Выбран объект обслуживания Электростанция,\nскорость подъема - от 1 до 60\nи высота подъема от 15 до 20,\nи грузоподъемность от 1 до 3'
}
rule('R35') {
    _if_ = [{ O == POWERSTATION }, {V >= 1}, {V <= 60}, {H > 15}, {H <= 20}, {W >= 3}, {W <= 600}]
    _then_ = { RESULT = [MK, KK] }
    _reason_ = 'Выбран объект обслуживания Электростанция,\nскорость подъема - от 1 до 60\nи высота подъема от 15 до 20,\nи грузоподъемность от 3 до 600'
}
rule('R36') {
    _if_ = [{ O == POWERSTATION }, {V >= 1}, {V <= 60}, {H > 15}, {H <= 20}, {W > 600}, {W <= 1000}]
    _then_ = { RESULT = [KK] }
    _reason_ = 'Выбран объект обслуживания Электростанция,\nскорость подъема - от 1 до 60\nи высота подъема от 15 до 20,\nи грузоподъемность от 600 до 1000'
}
rule('R37') {
    _if_ = [{ O == POWERSTATION }, {V >= 1}, {V <= 60}, {H > 20}, {H <= 50}]
    _then_ = { RESULT = [MK] }
    _reason_ = 'Выбран объект обслуживания Электростанция,\nскорость подъема - от 1 до 60\nи высота подъема от 20 до 50'
}
rule('R38') {
    _if_ = [{ O == POWERSTATION }, {V > 60}, {V <= 100}, {H >= 1}, {H < 2}]
    _then_ = { RESULT = [MP] }
    _reason_ = 'Выбран объект обслуживания Электростанция,\nскорость подъема - от 60 до 100\nи высота подъема от 1 до 2'
}
rule('R39') {
    _if_ = [{ O == POWERSTATION }, {V > 60}, {V <= 100}, {H >= 2}, {H <= 15}, {W >= 3}, {W < 5}]
    _then_ = { RESULT = [KK] }
    _reason_ = 'Выбран объект обслуживания Электростанция,\nскорость подъема - от 60 до 100\nи высота подъема от 2 до 15\nи грузоподъемность от 3 до 5'
}
rule('R40') {
    _if_ = [{ O == POWERSTATION }, {V > 60}, {V <= 100}, {H >= 2}, {H <= 15}, {W >= 5}, {W <= 300}]
    _then_ = { RESULT = [MP, KK] }
    _reason_ = 'Выбран объект обслуживания Электростанция,\nскорость подъема - от 60 до 100\nи высота подъема от 2 до 15\nи грузоподъемность от 5 до 300'
}
rule('R41') {
    _if_ = [{ O == POWERSTATION }, {V > 60}, {V <= 100}, {H >= 2}, {H <= 15}, {W > 300}, {W <= 1000}]
    _then_ = { RESULT = [KK] }
    _reason_ = 'Выбран объект обслуживания Электростанция,\nскорость подъема - от 60 до 100\nи высота подъема от 2 до 15\nи грузоподъемность от 300 до 1000'
}
rule('R42') {
    _if_ = [{ O == POWERSTATION }, {V > 60}, {V <= 100}, {H > 15}, {H <= 20}]
    _then_ = { RESULT = [KK] }
    _reason_ = 'Выбран объект обслуживания Электростанция,\nскорость подъема - от 60 до 100\nи высота подъема от 15 до 20'
}
rule('R43') {
    _if_ = [{ O == POWERSTATION }, {V > 100}, {V <= 180}]
    _then_ = { RESULT = [MP] }
    _reason_ = 'Выбран объект обслуживания Электростанция\nи скорость подъема - от 100 до 180'
}

// CONSTRUCTION

rule('R44') {
    _if_ = [{ O == CONSTRUCTION }, {V >= 1}, {V <= 25}, {H >= 1}, {H < 2}]
    _then_ = { RESULT = [SSK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 1 до 25\nи высота подъема от 1 до 2'
}
rule('R45') {
    _if_ = [{ O == CONSTRUCTION }, {V >= 1}, {V <= 25}, {H >= 2}, {H < 3}, {W >= 3}, {W < 5} ]
    _then_ = { RESULT = [KK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 1 до 25,\nвысота подъема от 2 до 3\nи грузоподъемность от 3 до 5'
}
rule('R46') {
    _if_ = [{ O == CONSTRUCTION }, {V >= 1}, {V <= 25}, {H >= 2}, {H < 3}, {W >= 5}, {W < 8} ]
    _then_ = { RESULT = [KK, PK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 1 до 25,\nвысота подъема от 2 до 3\nи грузоподъемность от 5 до 8'
}
rule('R47') {
    _if_ = [{ O == CONSTRUCTION }, {V >= 1}, {V <= 25}, {H >= 2}, {H < 3}, {W >= 8}, {W <= 30} ]
    _then_ = { RESULT = [KK, PK, SSK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 1 до 25,\nвысота подъема от 2 до 3\nи грузоподъемность от 8 до 30'
}
rule('R48') {
    _if_ = [{ O == CONSTRUCTION }, {V >= 1}, {V <= 25}, {H >= 2}, {H < 3}, {W > 30}, {W <= 300} ]
    _then_ = { RESULT = [KK, PK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 1 до 25,\nвысота подъема от 2 до 3\nи грузоподъемность от 30 до 300'
}
rule('R49') {
    _if_ = [{ O == CONSTRUCTION }, {V >= 1}, {V <= 25}, {H >= 3}, {H <= 20}, {W >= 3}, {W < 5} ]
    _then_ = { RESULT = [KK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 1 до 25,\nвысота подъема от 3 до 20\nи грузоподъемность от 3 до 5'
}
rule('R50') {
    _if_ = [{ O == CONSTRUCTION }, {V >= 1}, {V <= 25}, {H >= 3}, {H <= 20}, {W >= 5}, {W < 8} ]
    _then_ = { RESULT = [KK, PK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 1 до 25,\nвысота подъема от 3 до 20\nи грузоподъемность от 5 до 8'
}
rule('R51') {
    _if_ = [{ O == CONSTRUCTION }, {V >= 1}, {V <= 25}, {H >= 3}, {H <= 20}, {W >= 8}, {W < 10} ]
    _then_ = { RESULT = [KK, PK, SSK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 1 до 25,\nвысота подъема от 3 до 20\nи грузоподъемность от 8 до 10'
}
rule('R52') {
    _if_ = [{ O == CONSTRUCTION }, {V >= 1}, {V <= 25}, {H >= 3}, {H <= 20}, {W >= 10}, {W < 30} ]
    _then_ = { RESULT = [KK, PK, SSK, BK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 1 до 25,\nвысота подъема от 3 до 20\nи грузоподъемность от 10 до 30'
}
rule('R53') {
    _if_ = [{ O == CONSTRUCTION }, {V >= 1}, {V <= 25}, {H >= 3}, {H <= 20}, {W > 30}, {W <= 50} ]
    _then_ = { RESULT = [KK, PK, BK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 1 до 25,\nвысота подъема от 3 до 20\nи грузоподъемность от 30 до 50'
}
rule('R54') {
    _if_ = [{ O == CONSTRUCTION }, {V >= 1}, {V <= 25}, {H >= 3}, {H <= 20}, {W > 50}, {W <= 300} ]
    _then_ = { RESULT = [KK, PK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 1 до 25,\nвысота подъема от 3 до 20\nи грузоподъемность от 50 до 300'
}
rule('R55') {
    _if_ = [{ O == CONSTRUCTION }, {V >= 1}, {V <= 25}, {H >= 3}, {H <= 20}, {W > 300}, {W <= 1000} ]
    _then_ = { RESULT = [KK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 1 до 25,\nвысота подъема от 3 до 20\nи грузоподъемность от 300 до 1000'
}
rule('R56') {
    _if_ = [{ O == CONSTRUCTION }, {V >= 1}, {V <= 25}, {H > 20}, {H <= 50}, {W >= 5}, {W < 8} ]
    _then_ = { RESULT = [PK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 1 до 25,\nвысота подъема от 20 до 50\nи грузоподъемность от 5 до 8'
}
rule('R57') {
    _if_ = [{ O == CONSTRUCTION }, {V >= 1}, {V <= 25}, {H > 20}, {H <= 50}, {W >= 8}, {W < 10} ]
    _then_ = { RESULT = [PK, SSK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 1 до 25,\nвысота подъема от 20 до 50\nи грузоподъемность от 8 до 10'
}
rule('R58') {
    _if_ = [{ O == CONSTRUCTION }, {V >= 1}, {V <= 25}, {H > 20}, {H <= 50}, {W >= 10}, {W <= 30} ]
    _then_ = { RESULT = [PK, SSK, BK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 1 до 25,\nвысота подъема от 20 до 50\nи грузоподъемность от 10 до 30'
}
rule('R59') {
    _if_ = [{ O == CONSTRUCTION }, {V >= 1}, {V <= 25}, {H > 20}, {H <= 50}, {W > 30}, {W <= 50} ]
    _then_ = { RESULT = [PK, BK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 1 до 25,\nвысота подъема от 20 до 50\nи грузоподъемность от 30 до 50'
}
rule('R60') {
    _if_ = [{ O == CONSTRUCTION }, {V >= 1}, {V <= 25}, {H > 20}, {H <= 50}, {W > 50}, {W <= 300} ]
    _then_ = { RESULT = [PK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 1 до 25,\nвысота подъема от 20 до 50\nи грузоподъемность от 50 до 300'
}
rule('R61') {
    _if_ = [{ O == CONSTRUCTION }, {V >= 1}, {V <= 25}, {H > 50}, {H <= 60}, {W >= 8}, {W < 10} ]
    _then_ = { RESULT = [SSK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 1 до 25,\nвысота подъема от 50 до 60\nи грузоподъемность от 8 до 10'
}
rule('R62') {
    _if_ = [{ O == CONSTRUCTION }, {V >= 1}, {V <= 25}, {H > 50}, {H <= 60}, {W >= 10}, {W <= 30} ]
    _then_ = { RESULT = [SSK, BK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 1 до 25,\nвысота подъема от 50 до 60\nи грузоподъемность от 10 до 30'
}
rule('R63') {
    _if_ = [{ O == CONSTRUCTION }, {V >= 1}, {V <= 25}, {H > 50}, {H <= 60}, {W > 30}, {W <= 50} ]
    _then_ = { RESULT = [BK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 1 до 25,\nвысота подъема от 50 до 60\nи грузоподъемность от 30 до 50'
}
rule('R64') {
    _if_ = [{ O == CONSTRUCTION }, {V >= 1}, {V <= 25}, {H > 60}, {H <= 150}]
    _then_ = { RESULT = [BK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 1 до 25\nи высота подъема от 60 до 150'
}
rule('R65') {
    _if_ = [{ O == CONSTRUCTION }, {V > 25}, {V <= 90}, {H >= 2}, {H < 3}, {W >= 3}, {W < 5} ]
    _then_ = { RESULT = [KK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 25 до 90,\nвысота подъема от 2 до 3\nи грузоподъемность от 3 до 5'
}
rule('R66') {
    _if_ = [{ O == CONSTRUCTION }, {V > 25}, {V <= 90}, {H >= 2}, {H < 3}, {W >= 5}, {W <= 300} ]
    _then_ = { RESULT = [KK, PK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 25 до 90,\nвысота подъема от 2 до 3\nи грузоподъемность от 5 до 300'
}
rule('R67') {
    _if_ = [{ O == CONSTRUCTION }, {V > 25}, {V <= 90}, {H >= 2}, {H < 3}, {W > 300}, {W <= 1000} ]
    _then_ = { RESULT = [KK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 25 до 90,\nвысота подъема от 2 до 3\nи грузоподъемность от 300 до 1000'
}
rule('R68') {
    _if_ = [{ O == CONSTRUCTION }, {V > 25}, {V <= 90}, {H >= 3}, {H <= 20}, {W >= 5}, {W < 8} ]
    _then_ = { RESULT = [KK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 25 до 90,\nвысота подъема от 3 до 20\nи грузоподъемность от 5 до 8'
}
rule('R69') {
    _if_ = [{ O == CONSTRUCTION }, {V > 25}, {V <= 90}, {H >= 3}, {H <= 20}, {W >= 8}, {W < 10} ]
    _then_ = { RESULT = [KK, PK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 25 до 90,\nвысота подъема от 3 до 20\nи грузоподъемность от 8 до 10'
}
rule('R70') {
    _if_ = [{ O == CONSTRUCTION }, {V > 25}, {V <= 90}, {H >= 3}, {H <= 20}, {W >= 10}, {W <= 30} ]
    _then_ = { RESULT = [KK, PK, BK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 25 до 90,\nвысота подъема от 3 до 20\nи грузоподъемность от 10 до 30'
}
rule('R71') {
    _if_ = [{ O == CONSTRUCTION }, {V > 25}, {V <= 90}, {H >= 3}, {H <= 20}, {W > 30}, {W <= 50} ]
    _then_ = { RESULT = [KK, PK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 25 до 90,\nвысота подъема от 3 до 20\nи грузоподъемность от 30 до 50'
}
rule('R72') {
    _if_ = [{ O == CONSTRUCTION }, {V > 25}, {V <= 90}, {H >= 3}, {H <= 20}, {W > 50}, {W <= 300} ]
    _then_ = { RESULT = [KK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 25 до 90,\nвысота подъема от 3 до 20\nи грузоподъемность от 50 до 300'
}
rule('R73') {
    _if_ = [{ O == CONSTRUCTION }, {V > 25}, {V <= 90}, {H >= 20}, {H <= 50}, {W >= 5}, {W < 10} ]
    _then_ = { RESULT = [PK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 25 до 90,\nвысота подъема от 20 до 50\nи грузоподъемность от 5 до 10'
}
rule('R74') {
    _if_ = [{ O == CONSTRUCTION }, {V > 25}, {V <= 90}, {H >= 20}, {H <= 50}, {W >= 10}, {W <= 50} ]
    _then_ = { RESULT = [PK, BK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 25 до 90,\nвысота подъема от 20 до 50\nи грузоподъемность от 10 до 50'
}
rule('R75') {
    _if_ = [{ O == CONSTRUCTION }, {V > 25}, {V <= 90}, {H >= 20}, {H <= 50}, {W > 50}, {W <= 300} ]
    _then_ = { RESULT = [PK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 25 до 90,\nвысота подъема от 20 до 50\nи грузоподъемность от 50 до 300'
}
rule('R76') {
    _if_ = [{ O == CONSTRUCTION }, {V > 25}, {V <= 90}, {H > 50}, {H <= 150}]
    _then_ = { RESULT = [BK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект,\nскорость подъема - от 25 до 90\nи высота подъема от 50 до 150'
}
rule('R77') {
    _if_ = [{ O == CONSTRUCTION }, {V > 90}, {V <= 100}]
    _then_ = { RESULT = [BK] }
    _reason_ = 'Выбран объект обслуживания Строительный объект\nи скорость подъема - от 90 до 100'
}