rule('R1') {
    _if_ = [{ O == WORKSHOP }, {V > 60}, {V<=200}]
    _then_ = { RESULT = [NKPK] }
    _reason_ = 'Выбрано объект обслуживания Цех и скорость подъема - от 60 до 200'
}
rule('R2') {
    _if_ = [{ O == WORKSHOP }, {V >= 1}, {V <= 60}, {H >= 1}, {H < 3}]
    _then_ = { RESULT = [NKPK] }
    _reason_ = 'Выбран объект обслуживания Цех, скорость подъема - от 1 до 60 и высота подъема от 1 до 3'
}
rule('R3') {
    _if_ = [{ O == WORKSHOP }, {V >= 1}, {V <= 60}, {H > 10}, {H <= 50}]
    _then_ = { RESULT = [MK] }
    _reason_ = 'Выбран объект обслуживания Цех, скорость подъема - от 1 до 60 и высота подъема от 10 до 50'
}
rule('R4') {
    _if_ = [{ O == WORKSHOP }, {V >= 1}, {V <= 60}, {H >= 3}, {H <= 10}, {W >= 0.1}, {W < 1}]
    _then_ = { RESULT = [NKPK] }
    _reason_ = 'Выбран объект обслуживания Цех,\nскорость подъема - от 1 до 60,\nвысота подъема от 3 до 10\nи грузоподъемность от 0.1 до 1'
}
rule('R5') {
    _if_ = [{ O == WORKSHOP }, {V >= 1}, {V <= 60}, {H >= 3}, {H <= 10}, {W >= 1}, {W < 10}]
    _then_ = { RESULT = [NKPK, MK] }
    _reason_ = 'Выбран объект обслуживания Цех,\nскорость подъема - от 1 до 60,\nвысота подъема от 3 до 10\nи грузоподъемность от 1 до 10'
}
rule('R6') {
    _if_ = [{ O == WORKSHOP }, {V >= 1}, {V <= 60}, {H >= 3}, {H <= 10}, {W > 10}, {W <= 600}]
    _then_ = { RESULT = [MK] }
    _reason_ = 'Выбран объект обслуживания Цех,\nскорость подъема - от 1 до 60,\nвысота подъема от 3 до 10\nи грузоподъемность от 10 до 600'
}
rule('R7') {
    _if_ = [{ O == WAREHOUSE }, {V > 60}, {V <= 200}]
    _then_ = { RESULT = [NKPK] }
    _reason_ = 'Выбран объект обслуживания Закрытый склад,\nскорость подъема - от 60 до 200'
}
rule('R8') {
    _if_ = [{ O == WAREHOUSE }, {V >= 1}, {V <= 60}, {H >= 1}, {H < 3}]
    _then_ = { RESULT = [NKPK] }
    _reason_ = 'Выбран объект обслуживания Закрытый склад,\nскорость подъема - от 1 до 60,\nи высота подъема от 1 до 3'
}
rule('R9') {
    _if_ = [{ O == WAREHOUSE }, {V >= 1}, {V <= 60}, {H >= 3}, {H <= 10}]
    _then_ = { RESULT = [NKPK, MK] }
    _reason_ = 'Выбран объект обслуживания Закрытый склад,\nскорость подъема - от 1 до 60,\nи высота подъема от 3 до 10'
}
rule('R10') {
    _if_ = [{ O == WAREHOUSE }, {V >= 1}, {V <= 60}, {H > 10}, {H <= 50}]
    _then_ = { RESULT = [MK] }
    _reason_ = 'Выбран объект обслуживания Закрытый склад,\nскорость подъема - от 1 до 60,\nи высота подъема от 10 до 50'
}
rule('R11') {
    _if_ = [{ O == RIVERPORT }, {V > 100}, {V <= 180}]
    _then_ = { RESULT = [MP] }
    _reason_ = 'Выбран объект обслуживания Речной порт,\nскорость подъема - от 100 до 180'
}
rule('R12') {
    _if_ = [{ O == RIVERPORT }, {V > 90}, {V <= 100}, {H >= 1}, {H < 3}]
    _then_ = { RESULT = [MP] }
    _reason_ = 'Выбран объект обслуживания Речной порт,\nскорость подъема - от 90 до 100\nи высота подъема от 1 до 3'
}
rule('R13') {
    _if_ = [{ O == RIVERPORT }, {V > 90}, {V <= 100}, {H > 15}, {H <= 150}]
    _then_ = { RESULT = [BK] }
    _reason_ = 'Выбран объект обслуживания Речной порт,\nскорость подъема - от 90 до 100\nи высота подъема от 15 до 150'
}
rule('R14') {
    _if_ = [{ O == RIVERPORT }, {V > 90}, {V <= 100}, {H >= 3}, {H <= 15}, {G >= 5}, {G < 10}]
    _then_ = { RESULT = [MP] }
    _reason_ = 'Выбран объект обслуживания Речной порт,\nскорость подъема - от 90 до 100,\n высота подъема от 3 до 15\nи грузоподъемность от 5 до 10'
}
rule('R15') {
    _if_ = [{ O == RIVERPORT }, {V > 90}, {V <= 100}, {H >= 3}, {H <= 15}, {G >= 10}, {G <= 50}]
    _then_ = { RESULT = [MP, BK] }
    _reason_ = 'Выбран объект обслуживания Речной порт,\nскорость подъема - от 90 до 100,\n высота подъема от 3 до 15\nи грузоподъемность от 10 до 50'
}
rule('R16') {
    _if_ = [{ O == RIVERPORT }, {V > 90}, {V <= 100}, {H >= 3}, {H <= 15}, {G > 50}, {G <= 300}]
    _then_ = { RESULT = [BK] }
    _reason_ = 'Выбран объект обслуживания Речной порт,\nскорость подъема - от 90 до 100,\n высота подъема от 3 до 15\nи грузоподъемность от 50 до 300'
}
rule('R17') {
    _if_ = [{ O == RIVERPORT }, {V >= 1}, {V <= 90}, {H >= 1}, {H < 2}]
    _then_ = { RESULT = [MP] }
    _reason_ = 'Выбран объект обслуживания Речной порт,\nскорость подъема - от 1 до 90\nи высота подъема от 1 до 2'
}
rule('R18') {
    _if_ = [{ O == RIVERPORT }, {V >= 1}, {V <= 90}, {H >= 2}, {H < 3}]
    _then_ = { RESULT = [MP, PK] }
    _reason_ = 'Выбран объект обслуживания Речной порт,\nскорость подъема - от 1 до 90\nи высота подъема от 2 до 3'
}
rule('R19') {
    _if_ = [{ O == RIVERPORT }, {V >= 1}, {V <= 90}, {H >= 3}, {H <= 15}, {W >= 5}, {W < 10}]
    _then_ = { RESULT = [MP, PK] }
    _reason_ = 'Выбран объект обслуживания Речной порт,\nскорость подъема - от 1 до 90,\n высота подъема от 3 до 15\nи грузоподъемность от 5 до 10'
}
rule('R20') {
    _if_ = [{ O == RIVERPORT }, {V >= 1}, {V <= 90}, {H >= 3}, {H <= 15}, {W >= 10}, {W <= 50}]
    _then_ = { RESULT = [MP, PK, BK] }
    _reason_ = 'Выбран объект обслуживания Речной порт,\nскорость подъема - от 1 до 90,\n высота подъема от 3 до 15\nи грузоподъемность от 10 до 50'
}
rule('R21') {
    _if_ = [{ O == RIVERPORT }, {V >= 1}, {V <= 90}, {H >= 3}, {H <= 15}, {W > 50}, {W <= 300}]
    _then_ = { RESULT = [MP, PK] }
    _reason_ = 'Выбран объект обслуживания Речной порт,\nскорость подъема - от 1 до 90,\n высота подъема от 3 до 15\nи грузоподъемность от 50 до 300'
}
rule('R22') {
    _if_ = [{ O == RIVERPORT }, {V >= 1}, {V <= 90}, {H > 15}, {H <= 50}, {W >= 5}, {W < 10}]
    _then_ = { RESULT = [PK] }
    _reason_ = 'Выбран объект обслуживания Речной порт,\nскорость подъема - от 1 до 90,\n высота подъема от 15 до 50\nи грузоподъемность от 5 до 10'
}
rule('R23') {
    _if_ = [{ O == RIVERPORT }, {V >= 1}, {V <= 90}, {H > 15}, {H <= 50}, {W >= 10}, {W <= 50}]
    _then_ = { RESULT = [PK, BK] }
    _reason_ = 'Выбран объект обслуживания Речной порт,\nскорость подъема - от 1 до 90,\n высота подъема от 15 до 50\nи грузоподъемность от 10 до 50'
}
rule('R24') {
    _if_ = [{ O == RIVERPORT }, {V >= 1}, {V <= 90}, {H > 15}, {H <= 50}, {W > 50}, {W <= 300}]
    _then_ = { RESULT = [PK] }
    _reason_ = 'Выбран объект обслуживания Речной порт,\nскорость подъема - от 1 до 90,\n высота подъема от 15 до 50\nи грузоподъемность от 50 до 300'
}
rule('R25') {
    _if_ = [{ O == RIVERPORT }, {V >= 1}, {V <= 90}, {H > 50}, {H <= 150}]
    _then_ = { RESULT = [BK] }
    _reason_ = 'Выбран объект обслуживания Речной порт,\nскорость подъема - от 1 до 90\nи высота подъема от 50 до 150'
}
rule('R26') {
    _if_ = [{ O == POWERSTATION }, {V >= 1}, {V <= 60}, {H >= 1}, {H < 2}]
    _then_ = { RESULT = [MP] }
    _reason_ = 'Выбран объект обслуживания Электростанция,\nскорость подъема - от 1 до 60\nи высота подъема от 1 до 2'
}
rule('R27') {
    _if_ = [{ O == POWERSTATION }, {V >= 1}, {V <= 60}, {H >= 2}, {H < 3}, {W >=3}, {W < 5}]
    _then_ = { RESULT = [KK] }
    _reason_ = 'Выбран объект обслуживания Электростанция,\nскорость подъема - от 1 до 60\nи высота подъема от 2 до 3,\nи грузоподъемность от 3 до 5'
}
rule('R28') {
    _if_ = [{ O == POWERSTATION }, {V >= 1}, {V <= 60}, {H >= 2}, {H < 3}, {W >=5}, {W <= 300}]
    _then_ = { RESULT = [KK, MP] }
    _reason_ = 'Выбран объект обслуживания Электростанция,\nскорость подъема - от 1 до 60\nи высота подъема от 2 до 3,\nи грузоподъемность от 5 до 300'
}
rule('R29') {
    _if_ = [{ O == POWERSTATION }, {V >= 1}, {V <= 60}, {H >= 2}, {H < 3}, {W >300}, {W <= 1000}]
    _then_ = { RESULT = [KK] }
    _reason_ = 'Выбран объект обслуживания Электростанция,\nскорость подъема - от 1 до 60\nи высота подъема от 2 до 3,\nи грузоподъемность от 300 до 1000'
}
rule('R30') {
    _if_ = [{ O == POWERSTATION }, {V >= 1}, {V <= 60}, {H >= 3}, {H <= 15}, {W >= 3}, {W < 5}]
    _then_ = { RESULT = [MK] }
    _reason_ = 'Выбран объект обслуживания Электростанция,\nскорость подъема - от 1 до 60\nи высота подъема от 3 до 15,\nи грузоподъемность от 3 до 5'
}
rule('R31') {
    _if_ = [{ O == POWERSTATION }, {V >= 1}, {V <= 60}, {H >= 3}, {H <= 15}, {W >= 5}, {W <= 300}]
    _then_ = { RESULT = [MK, KK, MP] }
    _reason_ = 'Выбран объект обслуживания Электростанция,\nскорость подъема - от 1 до 60\nи высота подъема от 3 до 15,\nи грузоподъемность от 5 до 300'
}
rule('R32') {
    _if_ = [{ O == POWERSTATION }, {V >= 1}, {V <= 60}, {H >= 3}, {H <= 15}, {W > 300}, {W <= 600}]
    _then_ = { RESULT = [MK, KK] }
    _reason_ = 'Выбран объект обслуживания Электростанция,\nскорость подъема - от 1 до 60\nи высота подъема от 3 до 15,\nи грузоподъемность от 300 до 600'
}
rule('R33') {
    _if_ = [{ O == POWERSTATION }, {V >= 1}, {V <= 60}, {H >= 3}, {H <= 15}, {W > 600}, {W <= 1000}]
    _then_ = { RESULT = [KK] }
    _reason_ = 'Выбран объект обслуживания Электростанция,\nскорость подъема - от 1 до 60\nи высота подъема от 3 до 15,\nи грузоподъемность от 600 до 1000'
}
rule('R34') {
    _if_ = [{ O == POWERSTATION }, {V >= 1}, {V <= 60}, {H > 15}, {H <= 20}, {W >= 1}, {W < 3}]
    _then_ = { RESULT = [MK] }
    _reason_ = 'Выбран объект обслуживания Электростанция,\nскорость подъема - от 1 до 60\nи высота подъема от 15 до 20,\nи грузоподъемность от 1 до 3'
}